---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.CannotMakeRoomsGeometry
source: html/65d75bca-24ee-c12d-11c3-6b5eb03ef755.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.CannotMakeRoomsGeometry Property

Could not create geometry for [Room].

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeRoomsGeometry { get; }
```